tdxguiping/ESP32_S3_epaper/main/factory_reset/factory_reset.c
#include "factory_reset.h"

#include <dirent.h>
#include <errno.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <strings.h>
#include <sys/stat.h>
#include <sys/unistd.h>

#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_system.h"
#include "epd_display_app.h"
#include "epd_display_mode.h"
#include "app_persistent_state.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "image_business_worker.h"
#include "led_status.h"
#include "local_image_browsing.h"
#include "nvs.h"
#include "ch583_wifi_uart_protocol.h"
#include "server_network_sta_slideshow.h"
#include "server_network_sta_daily_image.h"
#include "server_network_sta_wifi_work_time.h"
#include "tdx_cfg.h"
#include "tdx_shared_spi.h"

static const char *TAG = "factory_reset";

#define FACTORY_RESET_TASK_STACK_SIZE (5 * 1024)
#define FACTORY_RESET_TASK_PRIORITY 3
#define FACTORY_RESET_WELCOME_DISPLAY_SIZE 960000U
#define FACTORY_RESET_WELCOME_PENDING_NVS_KEY "fr_welcome"
#define FACTORY_RESET_WELCOME_PENDING_VALUE 1U
#define WHITE 0x11

extern const uint8_t factory_reset_welcome_start[] asm("_binary_welcome_bin_start");
extern const uint8_t factory_reset_welcome_end[] asm("_binary_welcome_bin_end");

typedef struct {
    char base_path[SERVER_NETWORK_STA_DATAUP_BASE_PATH_MAX];
} factory_reset_context_t;

typedef struct {
    int upload_bin_deleted;
    int upload_jpg_deleted;
    int cast_bin_deleted;
    int cast_jpg_deleted;
    int config_deleted;
    int file_delete_failed;
    esp_err_t file_ret;
    esp_err_t nvs_ret;
    esp_err_t welcome_pending_ret;
    esp_err_t white_display_ret;
} factory_reset_result_t;

typedef enum {
    FACTORY_RESET_REQUEST_IDLE = 0,
    FACTORY_RESET_REQUEST_PENDING,
    FACTORY_RESET_REQUEST_RUNNING,
    FACTORY_RESET_REQUEST_COMPLETED,
} factory_reset_request_state_t;

typedef struct {
    factory_reset_request_state_t state;
    factory_reset_trigger_t trigger;
    uint16_t protocol_seq;
    bool guard_armed;
} factory_reset_request_t;

typedef struct {
    factory_reset_trigger_t trigger;
    uint16_t protocol_seq;
} factory_reset_worker_request_t;

_Static_assert(sizeof(factory_reset_worker_request_t) <=
                   USER_IMAGE_BUSINESS_WORKER_PAYLOAD_SIZE,
               "factory reset request exceeds image worker payload");

static TaskHandle_t s_factory_reset_task = NULL;
static factory_reset_context_t s_factory_reset_ctx;
static portMUX_TYPE s_factory_reset_request_mux = portMUX_INITIALIZER_UNLOCKED;
static factory_reset_request_t s_factory_reset_request;
static bool s_factory_reset_ready;
static uint32_t s_factory_reset_generation;
static bool s_factory_reset_submit_failure_logged;

static const char *factory_reset_trigger_to_string(factory_reset_trigger_t trigger)
{
    switch (trigger) {
    case FACTORY_RESET_TRIGGER_GPIO28:
        return "GPIO28";
    case FACTORY_RESET_TRIGGER_DEVICE_INFO_KEY_PB1:
        return "DEVICE_INFO_KEY_PB1";
    case FACTORY_RESET_TRIGGER_KEY_EVENT_PB1_PRESS:
        return "KEY_EVENT_PB1_PRESS";
    default:
        return "INVALID";
    }
}

static const char *factory_reset_request_state_to_string(
    factory_reset_request_state_t state)
{
    switch (state) {
    case FACTORY_RESET_REQUEST_IDLE:
        return "IDLE";
    case FACTORY_RESET_REQUEST_PENDING:
        return "PENDING";
    case FACTORY_RESET_REQUEST_RUNNING:
        return "RUNNING";
    case FACTORY_RESET_REQUEST_COMPLETED:
        return "COMPLETED";
    default:
        return "INVALID";
    }
}

static bool factory_reset_remote_request_is_pending(void)
{
    bool pending;
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    pending = s_factory_reset_request.state == FACTORY_RESET_REQUEST_PENDING;
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);
    return pending;
}

bool FactoryReset_IsBusy(void)
{
    factory_reset_request_state_t state;
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    state = s_factory_reset_request.state;
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);
    return state != FACTORY_RESET_REQUEST_IDLE;
}

static bool factory_reset_claim_remote_request(factory_reset_trigger_t *trigger,
                                               uint16_t *protocol_seq)
{
    bool claimed = false;
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    if (s_factory_reset_request.state == FACTORY_RESET_REQUEST_PENDING &&
        s_factory_reset_request.guard_armed) {
        s_factory_reset_request.state = FACTORY_RESET_REQUEST_RUNNING;
        if (trigger != NULL) {
            *trigger = s_factory_reset_request.trigger;
        }
        if (protocol_seq != NULL) {
            *protocol_seq = s_factory_reset_request.protocol_seq;
        }
        claimed = true;
    }
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);
    return claimed;
}

static bool factory_reset_claim_gpio_request(void)
{
    bool claimed = false;
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    if (s_factory_reset_request.state == FACTORY_RESET_REQUEST_IDLE) {
        ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(true);
        s_factory_reset_request.state = FACTORY_RESET_REQUEST_RUNNING;
        s_factory_reset_request.trigger = FACTORY_RESET_TRIGGER_GPIO28;
        s_factory_reset_request.protocol_seq = 0;
        s_factory_reset_request.guard_armed = true;
        claimed = true;
    }
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);
    return claimed;
}

static void factory_reset_finish_request(bool succeeded)
{
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    if (s_factory_reset_request.state == FACTORY_RESET_REQUEST_RUNNING) {
        s_factory_reset_request.state = succeeded
                                            ? FACTORY_RESET_REQUEST_COMPLETED
                                            : FACTORY_RESET_REQUEST_IDLE;
        s_factory_reset_request.guard_armed = false;
    }
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);
}

static bool factory_reset_name_has_ext(const char *name, const char *ext)
{
    size_t name_len;
    size_t ext_len;

    if (name == NULL || ext == NULL) {
        return false;
    }
    name_len = strlen(name);
    ext_len = strlen(ext);
    return name_len > ext_len && strcasecmp(name + name_len - ext_len, ext) == 0;
}

static void factory_reset_record_file_failure(factory_reset_result_t *result,
                                              const char *path,
                                              int error_number)
{
    if (result == NULL) {
        return;
    }
    result->file_delete_failed++;
    if (result->file_ret == ESP_OK) {
        result->file_ret = ESP_FAIL;
        ESP_LOGE(TAG,
                 "factory reset file cleanup failed path=%s errno=%d",
                 path != NULL ? path : "",
                 error_number);
    }
}

static bool factory_reset_delete_path_if_exists(const char *path,
                                                factory_reset_result_t *result)
{
    if (unlink(path) == 0) {
        return true;
    }
    if (errno != ENOENT) {
        factory_reset_record_file_failure(result, path, errno);
    }
    return false;
}

static int factory_reset_delete_files_with_ext(const char *dir_path,
                                               const char *ext,
                                               factory_reset_result_t *result)
{
    DIR *dir = opendir(dir_path);
    int deleted = 0;

    if (dir == NULL) {
        if (errno == ENOENT) {
            ESP_LOGW(TAG, "factory reset image dir missing path=%s", dir_path);
        } else {
            factory_reset_record_file_failure(result, dir_path, errno);
        }
        return 0;
    }

    struct dirent *entry = NULL;
    while (true) {
        errno = 0;
        entry = readdir(dir);
        if (entry == NULL) {
            if (errno != 0) {
                factory_reset_record_file_failure(result, dir_path, errno);
            }
            break;
        }
        if (!factory_reset_name_has_ext(entry->d_name, ext)) {
            continue;
        }

