tdxguiping/ESP32_S3_epaper/main/factory_reset/factory_reset.c
        // Factory reset must still remove legacy files whose names predate the 16-byte protocol limit.
        char path[SERVER_NETWORK_STA_DATAUP_BASE_PATH_MAX + SERVER_NETWORK_STA_DATAUP_FILE_NAME_MAX + 24];
        int len = snprintf(path, sizeof(path), "%s/%s", dir_path, entry->d_name);
        if (len < 0 || (size_t)len >= sizeof(path)) {
            factory_reset_record_file_failure(result, dir_path, ENAMETOOLONG);
            continue;
        }
        if (factory_reset_delete_path_if_exists(path, result)) {
            deleted++;
        }
    }

    if (closedir(dir) != 0) {
        factory_reset_record_file_failure(result, dir_path, errno);
    }
    return deleted;
}

static esp_err_t factory_reset_save_default_epd_mode(void)
{
    const uint8_t default_mode = USER_EPD_DISPLAY_MODE_DEFAULT;
    if (EpdDisplayMode_Get() != default_mode) {
        return EpdDisplayMode_Set(default_mode);
    }

    esp_err_t ret =
        app_nvs_write_u8(USER_EPD_DISPLAY_MODE_NVS_KEY, default_mode);
    if (ret != ESP_OK) {
        return ret;
    }

    uint8_t verified_mode = UINT8_MAX;
    ret = app_nvs_read_u8(USER_EPD_DISPLAY_MODE_NVS_KEY,
                          &verified_mode,
                          USER_EPD_DISPLAY_MODE_DEFAULT);
    if (ret != ESP_OK) {
        return ret;
    }
    if (verified_mode != default_mode) {
        ESP_LOGE(TAG,
                 "factory reset default EPD mode verify failed expected=%u read=%u",
                 (unsigned int)default_mode,
                 (unsigned int)verified_mode);
        return ESP_FAIL;
    }
    return ESP_OK;
}

static esp_err_t factory_reset_erase_wifi_namespace(void)
{
    nvs_handle_t handle = 0;
    esp_err_t ret = nvs_open("wifi", NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset open WiFi namespace failed ret=%s",
                 esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_erase_all(handle);
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset erase WiFi namespace failed ret=%s",
                 esp_err_to_name(ret));
    }
    return ret;
}

static esp_err_t factory_reset_erase_net80211_credentials(void)
{
    nvs_handle_t handle = 0;
    esp_err_t ret = nvs_open("nvs.net80211", NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset open nvs.net80211 failed ret=%s",
                 esp_err_to_name(ret));
        return ret;
    }

    esp_err_t ssid_ret = nvs_erase_key(handle, "sta.ssid");
    if (ssid_ret == ESP_ERR_NVS_NOT_FOUND) {
        ssid_ret = ESP_OK;
    }
    esp_err_t password_ret = nvs_erase_key(handle, "sta.pswd");
    if (password_ret == ESP_ERR_NVS_NOT_FOUND) {
        password_ret = ESP_OK;
    }
    if (ssid_ret == ESP_OK && password_ret == ESP_OK) {
        ret = nvs_commit(handle);
    } else {
        ret = ssid_ret != ESP_OK ? ssid_ret : password_ret;
    }
    nvs_close(handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset erase nvs.net80211 credentials failed ret=%s",
                 esp_err_to_name(ret));
    }
    return ret;
}

static esp_err_t factory_reset_clear_wifi_credentials(void)
{
    esp_err_t wifi_ret = factory_reset_erase_wifi_namespace();
    esp_err_t net80211_ret = factory_reset_erase_net80211_credentials();
    if (wifi_ret != ESP_OK) {
        return wifi_ret;
    }
    return net80211_ret;
}

static esp_err_t factory_reset_save_welcome_pending(void)
{
    esp_err_t ret = app_nvs_write_u8(FACTORY_RESET_WELCOME_PENDING_NVS_KEY,
                                     FACTORY_RESET_WELCOME_PENDING_VALUE);
    if (ret != ESP_OK) {
        return ret;
    }

    uint8_t value = 0;
    ret = app_nvs_read_u8(FACTORY_RESET_WELCOME_PENDING_NVS_KEY, &value, 0);
    if (ret != ESP_OK) {
        return ret;
    }
    if (value != FACTORY_RESET_WELCOME_PENDING_VALUE) {
        ESP_LOGE(TAG,
                 "factory reset welcome pending verify failed expected=%u actual=%u",
                 (unsigned int)FACTORY_RESET_WELCOME_PENDING_VALUE,
                 (unsigned int)value);
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "factory reset welcome pending saved");
    return ESP_OK;
}

static esp_err_t factory_reset_display_welcome(
    epd_display_reservation_t *reservation)
{
    const epd_type_config_t *epd_config = EpdType_GetCurrentConfig();
    size_t welcome_size =
        (size_t)(factory_reset_welcome_end - factory_reset_welcome_start);
    if (epd_config == NULL ||
        epd_config->display_size != FACTORY_RESET_WELCOME_DISPLAY_SIZE) {
        ESP_LOGE(TAG,
                 "factory reset welcome display size unsupported epd_type=%u actual=%u expected=%u",
                 epd_config != NULL ? (unsigned int)epd_config->type : 0U,
                 epd_config != NULL ? (unsigned int)epd_config->display_size : 0U,
                 (unsigned int)FACTORY_RESET_WELCOME_DISPLAY_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return ServerNetworkStaEpdDisplay_QueueReservedToScreenAndWait(
        reservation,
        factory_reset_welcome_start,
        welcome_size,
        1);
}

static void factory_reset_clear_persistent_state(factory_reset_result_t *result)
{
    esp_err_t ret = ESP_OK;
    esp_err_t one_ret;

    /*
     * English: Do not erase the whole PhotoPainter namespace. EPD type, work
     * timers, and CH583 BLE MAC are production-critical settings that survive.
     * Saved WiFi credentials are cleared separately from their two namespaces.
     */
    one_ret = app_nvs_erase_key(TDX_SLIDESHOW_NVS_PROGRESS_KEY);
    if (one_ret != ESP_OK && ret == ESP_OK) {
        ret = one_ret;
    }
    one_ret = app_nvs_erase_key(TDX_SLIDESHOW_NVS_LAST_FILE_KEY);
    if (one_ret != ESP_OK && ret == ESP_OK) {
        ret = one_ret;
    }
    one_ret = AppPersistentState_EraseImageState();
    if (one_ret != ESP_OK && ret == ESP_OK) {
        ret = one_ret;
    }
    one_ret = LocalImageBrowsing_ResetState();
    if (one_ret != ESP_OK && ret == ESP_OK) {
        ret = one_ret;
    }

